taurus/taurustest.yml
execution:
  concurrency: 10
  hold-for: 2m30s
  ramp-up: 1m
  scenario: Thread Group

scenarios:
  Thread Group:
    requests:
      - label: objectbox-all
        method: GET
        url: http://objectbox:8080/all
      - label: objectbox-active
        method: GET
        url: http://objectbox:8080/active
      - label: mapdb-all
        method: GET
        url: http://mapdb:8080/all
      - label: mapdb-active
        method: GET
        url: http://mapdb:8080/active