taurus/taurustest.yml
execution:
  concurrency: 10
  hold-for: 2m30s
  ramp-up: 1m
  scenario: Thread Group

scenarios:
  Thread Group:
    requests:
      - label: objectbox-insert-query-all
        method: POST
        url: http://objectbox:8080/insert?name=testName&filter=all
      - label: mapdb-insert-query-all
        method: POST
        url: http://mapdb:8080/insert?name=testName&filter=all