taurus/taurustest.yml
execution:
- concurrency: 100
  hold-for: 30m
  ramp-up: 10m
  throughput: 150
  steps: 5
  scenario: insert
- concurrency: 15
  hold-for: 30m
  ramp-up: 20m
  throughput: 45
  steps: 3
  scenario: query-all
- concurrency: 100
  hold-for: 30m
  ramp-up: 15m
  throughput: 90
  steps: 9
  scenario: query-completed

scenarios:
  insert:
    requests:
      - label: objectbox-insert
        method: POST
        url: http://objectbox:8080/todo-items?name=${name}
#      - label: mapdb-insert
#        method: POST
#        url: http://mapdb:8080/todo-items?name=${name}
      - label: nitrite-insert
        method: POST
        url: http://nitrite:8080/todo-items?name=${name}
#      - label: mongo-insert
#        method: POST
#        url: http://mongo:8080/todo-items?name=${name}
    data-sources:
      - path: /bzt-configs/test-data.csv
        delimiter: ','
        quoted: false
        loop: true
        variable-names: name
        random-order: false
  query-all:
    requests:
      - label: objectbox-query-all
        method: GET
        url: http://objectbox:8080/todo-items
#      - label: mapdb-query-all
#        method: GET
#        url: http://mapdb:8080/todo-items
      - label: nitrite-query-all
        method: GET
        url: http://nitrite:8080/todo-items
#      - label: mongo-query-all
#        method: GET
#        url: http://mongo:8080/todo-items
  query-completed:
    requests:
      - label: objectbox-query-completed
        method: GET
        url: http://objectbox:8080/todo-items/completed
#      - label: mapdb-query-completed
#        method: GET
#        url: http://mapdb:8080/todo-items/completed
      - label: nitrite-query-completed
        method: GET
        url: http://nitrite:8080/todo-items/completed
#      - label: mongo-query-completed
#        method: GET
#        url: http://mongo:8080/todo-items/completed